In [166]:
import pandas as pd
df=pd.read_csv("C:/Users/Dell/OneDrive/Documents/python projects vyshu/Project 1/application_train.csv")

In [167]:
#1. Load the dataset and display the first 5 rows.
df.head(5)

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
0,100002,1,Cash loans,M,N,Y,0,202500.0,406597.5,24700.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,1.0
1,100003,0,Cash loans,F,N,N,0,270000.0,1293502.5,35698.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
2,100004,0,Revolving loans,M,Y,Y,0,67500.0,135000.0,6750.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
3,100006,0,Cash loans,F,N,Y,0,135000.0,312682.5,29686.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,100007,0,Cash loans,M,N,Y,0,121500.0,513000.0,21865.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0

In [168]:
#2. Check the shape 
df.shape

(307511, 122)

In [169]:
#and column types of the dataset.
df.dtypes

SK_ID_CURR                      int64
TARGET                          int64
NAME_CONTRACT_TYPE             object
CODE_GENDER                    object
FLAG_OWN_CAR                   object
                               ...
AMT_REQ_CREDIT_BUREAU_DAY     float64
AMT_REQ_CREDIT_BUREAU_WEEK    float64
AMT_REQ_CREDIT_BUREAU_MON     float64
AMT_REQ_CREDIT_BUREAU_QRT     float64
AMT_REQ_CREDIT_BUREAU_YEAR    float64
Length: 122, dtype: object

In [170]:
#3. Get a summary of all numeric columns using `.describe()`.
numeric_col=df.select_dtypes(include="number")

In [171]:
numeric_col.describe()

,SK_ID_CURR,TARGET,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,AMT_GOODS_PRICE,REGION_POPULATION_RELATIVE,DAYS_BIRTH,DAYS_EMPLOYED,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
count,307511.000000,307511.000000,307511.000000,3.075110e+05,3.075110e+05,307499.000000,3.072330e+05,307511.000000,307511.000000,307511.000000,...,307511.000000,307511.000000,307511.000000,307511.000000,265992.000000,265992.000000,265992.000000,265992.000000,265992.000000,265992.000000
mean,278180.518577,0.080729,0.417052,1.687979e+05,5.990260e+05,27108.573909,5.383962e+05,0.020868,-16036.995067,63815.045904,...,0.008130,0.000595,0.000507,0.000335,0.006402,0.007000,0.034362,0.267395,0.265474,1.899974
std,102790.175348,0.272419,0.722121,2.371231e+05,4.024908e+05,14493.737315,3.694465e+05,0.013831,4363.988632,141275.766519,...,0.089798,0.024387,0.022518,0.018299,0.083849,0.110757,0.204685,0.916002,0.794056,1.869295
min,100002.000000,0.000000,0.000000,2.565000e+04,4.500000e+04,1615.500000,4.050000e+04,0.000290,-25229.000000,-17912.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,189145.500000,0.000000,0.000000,1.125000e+05,2.700000e+05,16524.000000,2.385000e+05,0.010006,-19682.000000,-2760.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,278202.000000,0.000000,0.000000,1.471500e+05,5.135310e+05,24903.000000,4.500000e+05,0.018850,-15750.000000,-1213.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
75%,367142.500000,0.000000,1.000000,2.025000e+05,8.086500e+05,34596.000000,6.795000e+05,0.028663,-12413.000000,-289.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,3.000000
max,456255.000000,1.000000,19.000000,1.170000e+08,4.050000e+06,258025.500000,4.050000e+06,0.072508,-7489.000000,365243.000000,...,1.000000,1.000000,1.000000,1.000000,4.000000,9.000000,8.000000,27.000000,261.000000,25.000000

In [83]:
#4. Count total missing values column-wise.
missing_val=df.isna().sum()
print(missing_val)

SK_ID_CURR                        0
TARGET                            0
NAME_CONTRACT_TYPE                0
CODE_GENDER                       0
FLAG_OWN_CAR                      0
                              ...
AMT_REQ_CREDIT_BUREAU_DAY     41519
AMT_REQ_CREDIT_BUREAU_WEEK    41519
AMT_REQ_CREDIT_BUREAU_MON     41519
AMT_REQ_CREDIT_BUREAU_QRT     41519
AMT_REQ_CREDIT_BUREAU_YEAR    41519
Length: 122, dtype: int64

In [173]:
#5. Display unique values in `NAME_CONTRACT_TYPE`.

df['NAME_CONTRACT_TYPE'].unique()

array(['Cash loans', 'Revolving loans'], dtype=object)

#### DATA CLEANING

In [176]:
#6. Replace all empty strings or spaces with `NaN`.
import numpy as np
df=df.replace(r'^\s*$',np.nan,regex=True)
print(df)

        SK_ID_CURR  TARGET NAME_CONTRACT_TYPE CODE_GENDER FLAG_OWN_CAR  \
0           100002       1         Cash loans           M            N
1           100003       0         Cash loans           F            N
2           100004       0    Revolving loans           M            Y
3           100006       0         Cash loans           F            N
4           100007       0         Cash loans           M            N
...            ...     ...                ...         ...          ...
307506      456251       0         Cash loans           M            N
307507      456252       0         Cash loans           F            N
307508      456253       0         Cash loans           F            N
307509      456254       1         Cash loans           F            N
307510      456255       0         Cash loans           F            N

       FLAG_OWN_REALTY  CNT_CHILDREN  AMT_INCOME_TOTAL  AMT_CREDIT  \
0                    Y             0          202500.0    406597.5
1                    N             0          270000.0   1293502.5
2                    Y             0           67500.0    135000.0
3                    Y             0          135000.0    312682.5
4                    Y             0          121500.0    513000.0
...                ...           ...               ...         ...
307506               N             0          157500.0    254700.0
307507               Y             0           72000.0    269550.0
307508               Y             0          153000.0    677664.0
307509               Y             0          171000.0    370107.0
307510               N             0          157500.0    675000.0

        AMT_ANNUITY  ...  FLAG_DOCUMENT_18 FLAG_DOCUMENT_19 FLAG_DOCUMENT_20  \
0           24700.5  ...                 0                0                0
1           35698.5  ...                 0                0                0
2            6750.0  ...                 0                0                0
3           29686.5  ...                 0                0                0
4           21865.5  ...                 0                0                0
...             ...  ...               ...              ...              ...
307506      27558.0  ...                 0                0                0
307507      12001.5  ...                 0                0                0
307508      29979.0  ...                 0                0                0
307509      20205.0  ...                 0                0                0
307510      49117.5  ...                 0                0                0

       FLAG_DOCUMENT_21 AMT_REQ_CREDIT_BUREAU_HOUR AMT_REQ_CREDIT_BUREAU_DAY  \
0                     0                        0.0                       0.0
1                     0                        0.0                       0.0
2                     0                        0.0                       0.0
3                     0                        NaN                       NaN
4                     0                        0.0                       0.0
...                 ...                        ...                       ...
307506                0                        NaN                       NaN
307507                0                        NaN                       NaN
307508                0                        1.0                       0.0
307509                0                        0.0                       0.0
307510                0                        0.0                       0.0

        AMT_REQ_CREDIT_BUREAU_WEEK  AMT_REQ_CREDIT_BUREAU_MON  \
0                              0.0                        0.0
1                              0.0                        0.0
2                              0.0                        0.0
3                              NaN                        NaN
4                              0.0                        0.0
...                            ...                        ...
307506                         NaN                        NaN
307507                         NaN                        NaN
307508                         0.0                        1.0
307509                         0.0                        0.0
307510                         0.0                        2.0

        AMT_REQ_CREDIT_BUREAU_QRT  AMT_REQ_CREDIT_BUREAU_YEAR
0                             0.0                         1.0
1                             0.0                         0.0
2                             0.0                         0.0
3                             NaN                         NaN
4                             0.0                         0.0
...                           ...                         ...
307506                        NaN                         NaN
307507                        NaN                         NaN
307508                        0.0                         1.0
307509                        0.0                         0.0
307510                        0.0                         1.0

[307511 rows x 122 columns]

In [87]:
df['OCCUPATION_TYPE']

0            Laborers
1          Core staff
2            Laborers
3            Laborers
4          Core staff
             ...
307506    Sales staff
307507            NaN
307508       Managers
307509       Laborers
307510       Laborers
Name: OCCUPATION_TYPE, Length: 307511, dtype: object

In [88]:
df['AMT_ANNUITY'].median()

np.float64(24903.0)

In [177]:
#7. Fill missing values in `AMT_ANNUITY` with the median.

df['AMT_ANNUITY'].fillna(df['AMT_ANNUITY'].median())

0         24700.5
1         35698.5
2          6750.0
3         29686.5
4         21865.5
           ...
307506    27558.0
307507    12001.5
307508    29979.0
307509    20205.0
307510    49117.5
Name: AMT_ANNUITY, Length: 307511, dtype: float64

In [178]:
#8. Drop rows where `CODE_GENDER` is null.
df['CODE_GENDER'].dropna()

0         M
1         F
2         M
3         F
4         M
         ..
307506    M
307507    F
307508    F
307509    F
307510    F
Name: CODE_GENDER, Length: 307511, dtype: object

In [179]:
df['CODE_GENDER'].isna()

0         False
1         False
2         False
3         False
4         False
          ...
307506    False
307507    False
307508    False
307509    False
307510    False
Name: CODE_GENDER, Length: 307511, dtype: bool

In [180]:

#9. Replace 'XNA' in `CODE_GENDER` with the mode.
mode=df['CODE_GENDER'].mode()[0]
df['CODE_GENDER']=df['CODE_GENDER'].replace('XNA',mode)

In [181]:
(df['CODE_GENDER']=='XNA').sum()

np.int64(0)

In [182]:
df.shape

(307511, 122)

In [92]:
#10. Remove duplicate rows if any.

In [183]:
duplicate_rows=df.dropna().any()

In [95]:
print(duplicate_rows)

SK_ID_CURR                    True
TARGET                        True
NAME_CONTRACT_TYPE            True
CODE_GENDER                   True
FLAG_OWN_CAR                  True
                              ...
AMT_REQ_CREDIT_BUREAU_DAY     True
AMT_REQ_CREDIT_BUREAU_WEEK    True
AMT_REQ_CREDIT_BUREAU_MON     True
AMT_REQ_CREDIT_BUREAU_QRT     True
AMT_REQ_CREDIT_BUREAU_YEAR    True
Length: 122, dtype: bool

In [184]:
#11. Count how many people have `NAME_CONTRACT_TYPE = Cash loans`.
count_cashloans=(df['NAME_CONTRACT_TYPE']=="Cash loans").sum()

In [185]:
print(count_cashloans)

278232

In [186]:
#12. How many applicants are male vs female?
gender_count=df['CODE_GENDER'].value_counts()
print(gender_count)

CODE_GENDER
F    202452
M    105059
Name: count, dtype: int64

In [187]:
#13. What is the average `AMT_CREDIT` by `NAME_CONTRACT_TYPE`?

average=df.groupby('NAME_CONTRACT_TYPE')['AMT_CREDIT'].mean()
print(average)

NAME_CONTRACT_TYPE
Cash loans         627965.732538
Revolving loans    324017.982172
Name: AMT_CREDIT, dtype: float64

In [188]:
#14. Group by `NAME_INCOME_TYPE` and find the mean `AMT_INCOME_TOTAL`.

mean=df.groupby('NAME_INCOME_TYPE')['AMT_INCOME_TOTAL'].mean()
print(mean)

NAME_INCOME_TYPE
Businessman             652500.000000
Commercial associate    202955.327289
Maternity leave         140400.000000
Pensioner               136401.292273
State servant           179737.969506
Student                 170500.000000
Unemployed              110536.363636
Working                 163169.889223
Name: AMT_INCOME_TOTAL, dtype: float64

In [189]:
#15. Sort top 10 applicants with highest `AMT_INCOME_TOTAL`.

sorted_df=df.sort_values(by='AMT_INCOME_TOTAL',ascending=False).head(10)

In [121]:
sorted_df

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
12840,114967,1,Cash loans,F,N,Y,1,117000000.0,562491.0,26194.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,1.0
203693,336147,0,Cash loans,M,Y,Y,2,18000090.0,675000.0,69295.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
246858,385674,0,Cash loans,M,Y,Y,0,13500000.0,1400503.5,130945.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
77768,190160,0,Cash loans,F,Y,N,0,9000000.0,1431531.0,132601.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
131127,252084,0,Cash loans,M,Y,N,0,6750000.0,790830.0,52978.5,...,0,0,0,0,0.0,0.0,1.0,0.0,0.0,4.0
103006,219563,0,Revolving loans,M,Y,Y,0,4500000.0,2250000.0,225000.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,2.0
287463,432980,0,Cash loans,M,Y,Y,0,4500000.0,1755000.0,61132.5,...,0,0,0,0,0.0,0.0,1.0,0.0,0.0,0.0
187833,317748,0,Cash loans,M,N,N,0,4500000.0,835380.0,42651.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,2.0
204564,337151,0,Cash loans,M,N,N,0,4500000.0,450000.0,47749.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
181698,310601,0,Cash loans,M,Y,Y,1,3950059.5,675000.0,66217.5,...,1,0,0,0,0.0,0.0,0.0,0.0,0.0,1.0

#### AGGREGATION AND GROUPING

In [190]:
#16. Count number of applicants per `OCCUPATION_TYPE`.

no_of_applicants=df['OCCUPATION_TYPE'].value_counts()

In [191]:
print(no_of_applicants)

OCCUPATION_TYPE
Laborers                 55186
Sales staff              32102
Core staff               27570
Managers                 21371
Drivers                  18603
High skill tech staff    11380
Accountants               9813
Medicine staff            8537
Security staff            6721
Cooking staff             5946
Cleaning staff            4653
Private service staff     2652
Low-skill Laborers        2093
Waiters/barmen staff      1348
Secretaries               1305
Realty agents              751
HR staff                   563
IT staff                   526
Name: count, dtype: int64

In [192]:
#17. Find mean, median, and std dev of `AMT_CREDIT` grouped by `TARGET`.

value=df.groupby('TARGET')['AMT_CREDIT'].agg(['mean','median','std'])
print(value)

                 mean    median            std
TARGET
0       602648.282002  517788.0  406845.907710
1       557778.527674  497520.0  346433.235646

In [193]:
#18. Create a pivot table of `AMT_CREDIT` vs `NAME_EDUCATION_TYPE` and `TARGET`.


# Assuming you have a DataFrame named df
pivot_table = pd.pivot_table(
    df,
    values='AMT_CREDIT',
    index='NAME_EDUCATION_TYPE',
    columns='TARGET',
    aggfunc='mean'
)

print(pivot_table)

TARGET                                     0              1
NAME_EDUCATION_TYPE
Academic degree                719290.844720  950245.500000
Higher education               692438.297379  645981.010851
Incomplete higher              569696.524880  534740.986239
Lower secondary                490749.537511  481589.525180
Secondary / secondary special  574033.649640  542263.182160

In [194]:
#19. Count how many applicants own a car vs not (`FLAG_OWN_CAR`).

car_status=df['FLAG_OWN_CAR'].value_counts()
print(car_status)

FLAG_OWN_CAR
N    202924
Y    104587
Name: count, dtype: int64

In [195]:
#20. Find average `DAYS_BIRTH` grouped by `NAME_FAMILY_STATUS`.

average=df.groupby('NAME_FAMILY_STATUS')['DAYS_BIRTH'].mean()
print(abs(average))

NAME_FAMILY_STATUS
Civil marriage          15160.057565
Married                 16067.452274
Separated               16921.698938
Single / not married    14336.475772
Unknown                 12620.000000
Widow                   21004.839508
Name: DAYS_BIRTH, dtype: float64

#### FEATURE ENGINEERING

In [196]:
#21. Create a new column: `AGE_YEARS = -DAYS_BIRTH / 365`.
df['AGE_YEARS'] = -df['DAYS_BIRTH'] / 365

In [145]:
df['AGE_YEARS']

0         25.920548
1         45.931507
2         52.180822
3         52.068493
4         54.608219
            ...
307506    25.553425
307507    56.917808
307508    41.002740
307509    32.769863
307510    46.180822
Name: AGE_YEARS, Length: 307511, dtype: float64

In [197]:
#22. Create a new column: `CREDIT_INCOME_RATIO = AMT_CREDIT / AMT_INCOME_TOTAL`.

df['CREDIT_INCOME_RATIO'] = df['AMT_CREDIT']/df['AMT_INCOME_TOTAL']

In [150]:
df['CREDIT_INCOME_RATIO']

0         2.007889
1         4.790750
2         2.000000
3         2.316167
4         4.222222
            ...
307506    1.617143
307507    3.743750
307508    4.429176
307509    2.164368
307510    4.285714
Name: CREDIT_INCOME_RATIO, Length: 307511, dtype: float64

In [198]:
#23. Bin `AGE_YEARS` into 5 quantile-based age groups.
df['AGE_GROUP'] = pd.qcut(df['AGE_YEARS'], q=5, labels=[
    'child', 
    'teen', 
    'adult', 
    'senior', 
    'super senior '
])

In [153]:
df['AGE_GROUP']

0                 child
1                 adult
2                senior
3                senior
4                senior
              ...
307506            child
307507    super senior
307508            adult
307509             teen
307510            adult
Name: AGE_GROUP, Length: 307511, dtype: category
Categories (5, object): ['child' < 'teen' < 'adult' < 'senior' < 'super senior ']

In [199]:
#24. Encode `FLAG_OWN_CAR` as binary.
df['FLAG_OWN_CAR_BINARY'] = df['FLAG_OWN_CAR'].map({'Y': 1, 'N': 0})

In [157]:
df['FLAG_OWN_CAR_BINARY']

0         0
1         0
2         1
3         0
4         0
         ..
307506    0
307507    0
307508    0
307509    0
307510    0
Name: FLAG_OWN_CAR_BINARY, Length: 307511, dtype: int64

In [200]:
#25. Extract year from `DAYS_EMPLOYED`.
df['YEARS_EMPLOYED'] = (-df['DAYS_EMPLOYED'] // 365)

In [165]:
df['YEARS_EMPLOYED']

0            1
1            3
2            0
3            8
4            8
          ...
307506       0
307507   -1001
307508      21
307509      13
307510       3
Name: YEARS_EMPLOYED, Length: 307511, dtype: int64